#include <iostream>
#include <string>
#include <vector>

using namespace std;

int main(){
////------------------------------과제1-----------------------------------------
////과제1 숫자를 두개를 입력받고 음수나 0이면 다시 입력받기
//	cout << "Please enter two natural numbers : " << endl;
//	int x, y;
//	cin >> x >> y;
//	//과제2 x,y에 0이나 음수를 입력 할 경우 에러 메세지 출력후 다시 입력받기
//	if (x <= 0 || y <= 0)
//	{
//		cout << "error : Bro natural number please~" << endl;
//		cin >> x >> y;
//		cout << "Okay~ very good sir~" << endl;
//	}
////------------------------------과제2-----------------------------------------
////과제2 숫자 2개 입력받고 그걸로  1씩 커지는 2차원 행렬 구현하기
//	cout << " 행열의 x값 y값을 차례로 입력하세요." << endl;
//	int row, col;
//	cin >> row >> col;
//	int score = 0;
//******************************************************************************
//	vector<vector<int>>v(row, vector<int>(col, score));
//******************************************************************************
//	for (int i = 0; i < row; i++) {
//	    for (int j = 0; j < col; j++){
//	        v.at(i).at(j) = score++;
//			cout << score << " ";
//	    }
//		cout << endl;
//	} 
////------------------------------과제3-----------------------------------------
////과제3 사용자가 입력한 숫자들을 배열에 담고, 그 수의 합을 구하기
//    int sum = 0;
//    vector<int> v;
//    while (1) {
//        cout << " 숫자를 입력해주세요. : (0:exit) ";
//        int x; 
//        cin >> x;  //점수 입력받기
//
//        if (x != 0) {
//            v.push_back(x);
//        }
//        else {
//            for (int i = 0; i < v.size(); i++)
//            {
//                sum += v.at(i);
//
//            }
//            cout << "사용자가 입력한 수의 합은 : " << sum;
//            break;
//        }
//    }
////------------------------------과제3-----------------------------------------
////과제4 영어로된 문자열 모두 소문자로 입력 받아서 문자열에 사용된 문자의 개수를 구해
//    //1. 소문자 문자열을 입력받는다
//    string name;
//    cin >> name;
//    //2. 문자열을 하나하나 쪼갠다
//    //3. 쪼갠 갯수를 구한다.






	return 0;
}