#include <iostream>
#include <string>
#include <vector>

using namespace std;

int main()
{
////---------------------------벡터 선언-----------------------------------------
       //vector<int> v; //숫자 벡터 선언
       //vector<int> v1 = { 1,2,3,4 }; //숫자 할당 벡터 선언(1)
       ////{ 1, 2, 3, 4,}
       //vector<int> v2(4); // 크기가 4인 배열, 모든 값 0으로 초기화(2)
       ////{ 0, 0, 0, 0 }
       //vector<int> v3(5, 1); // 크기가 4인 배열, 1로 모든 값 배정(3)
       ////{ 1, 1, 1, 1}
       //vector<string> v_str; //문자 벡터 선언
       ////{"a", "b", "c"}

       //vector<int> V;
       //V.assign(5, 2); //크기가 5인 배열, 모든 값을 2로 초기화
       ////{ 2, 2, 2, 2, 2 }

////---------------------------벡터 함수-----------------------------------------
    //vector<int> v; //****기본적인 벡터 문법****
    //v.assign(5, 2); //크기가 5인 배열, 모든 값을 2로 초기화
    ////{ 2, 2, 2, 2, 2 }

    ////v.size(); // 벡터v의 사이즈(5) 반환
    //for (int i = 0; i < v.size(); i++)
    //{
    //    cout << v[i] << " ";// 2 2 2 2 2 : out of range 위험이 발생함.
    //    //v.at();   //출력할 때 오류 없이 출력 할 수 있다.
    //    cout << v.at(i) << " ; " << endl;// 2 2 2 2 2 : 그 오류를 잡아줌.
    //}// => 2 2 ; 2 2 ; 2 2 ; 2 2 ; 2 2 ;

    //v.push_back(6);  //벡터의 마지막에 원소를 넣는다.
    ////{ 2, 2, 2, 2, 2, 6 }
    //v.pop_back();    //벡터의 마지막 원소를 꺼낸다.
    ////{ 2, 2, 2, 2, 2 }
    //v.begin();       //사용시 벡터의 시작주소를 반환함.
    //v.insert(v.begin() + 1, 0); //(넣고 싶은 자리, 넣고 싶은 숫자) : *추가시킴
    ////{ 2, 0, 2, 2, 2, 2 }
    //v.erase(v.begin(), v.begin() + 2); //삭제하고 싶은 범위를 삭제함.
    ////{ 2, 2, 2, 2 }
    //for (int i = 0; i < v.size(); i++)
    //{
    //    cout << v.at(i) << " ";
    //}// => 2 2 2 2
    //v.clear();      //벡터 제거.
    //v.front();      //첫번째 벡터 접근.

////---------------------------2차원 벡터 함수 출력------------------------------
    //vector<vector<int>> v_2d = { {1,2},{3,4} };
    //for (int i = 0; i < v_2d.size(); i++) {
    //    for (int j = 0; j < v_2d.at(i).size(); j++){
    //        cout << v_2d.at(i).at(j) << " ";
    //    }
    //} 

////---------------------------벡터 입력과 출력----------------------------------
    //int x, y;
    //cin >> x >> y; //x = 5, y = 4 입력 시
    //vector<int> v; 
    //v.assign(x, y); //크기가 5인 배열, 모든 값을 4로 초기화

    //for (int i = 0; i < v.size(); i++)
    //{
    //    cout << v.at(i) << " , ";
    //}// => 4, 4, 4, 4, 4
////---------------------------벡터 응용하기--------------------------------------------------
    //반인원을 입력하고 점수를 입력후 전체 합을 내기
    int x;
    cin >> x; //몇 명인지 입력해주세요.
    vector<int> v(x);
    int sum = 0;
    for (int i = 0; i < v.size(); i++)
    {
        cin >> v.at(i);
        sum += v.at(i);

    }
    cout << sum;

    return 0;
}